jhlee741/ece342lab0/blinky-2/blinky/Drivers/CMSIS/.Web/Geehy.APM32F1xx_DFP.pdsc
<?xml version="1.0" encoding="utf-8"?>
<package schemaVersion="1.4" xmlns:xs="http://www.w3.org/2001/XMLSchema-instance" xs:noNamespaceSchemaLocation="PACK.xsd">
    <vendor>Geehy</vendor>
    <name>APM32F1xx_DFP</name>
    <description>Geehy Semiconductor APM32F1 Series Device Support, Drivers and Examples</description>
    <url>https://www.geehy.com/uploads/tool/</url><supportContact>https://www.geehy.com/support/apm</supportContact>
    <releases>
        <release version="1.0.0" date="2019-12-17">
      First Release version of APM32F1 Device Family Pack.
        </release>
        <release version="1.0.1" date="2020-04-26">
      Add APM32F103xCxDxE Device.
      Add CMSIS drivers:
      - DAC
      - DBGMCU
      - EMMC
      - QSPI
      - SCI2C
      - SDI0
      - SDRC
      Updated drivers.
        </release>
        <release version="1.0.2" date="2020-07-20">
      Correct svd file.
        </release>
        <release version="1.0.3" date="2020-08-22">
      Correct DBGMCU->IDCODE_B.REVID bitOffset and bitWidth.
        </release>
        <release version="1.0.4" date="2020-09-17">
      Change the url.
        </release>
        <release version="1.0.5" date="2020-09-25">
      Change the description,vendor.
        </release>
        <release version="1.0.6" date="2021-03-23">
      Updata the Drivers is 1.0.1
      Updata the APM32F103xx.svd
        </release>
        <release version="1.0.7" date="2021-05-20">
      Add APM32F103VCS_MINI_Board Example
        </release>
        <release version="1.0.8" date="2022-02-24">
      Add DebugCore support.
        </release>
        <release version="1.0.9" date="2022-08-04">
      Add APM32F107 and APM32F105 serial MCU support.
        </release>
        <release version="1.1.0" date="2022-12-01">
      Updata the Drivers is 1.0.4
      Add APM32F107VC_MINI_Board Example</release>
    </releases>
    <keywords>
        <!-- keywords for indexing -->
        <keyword>Geehy</keyword>
        <keyword>Device Support</keyword>
        <keyword>Device Family Package Geehy Semiconductor</keyword>
        <keyword>APM32F1</keyword>
        <keyword>APM32</keyword>
    </keywords>
    <devices>
        <family Dfamily="APM32F1 Series" Dvendor="Geehy:163">
            <processor Dcore="Cortex-M3" DcoreVersion="r1p1"/>
            <book name="Documents/dui0552a_cortex_m3_dgug.pdf" title="Cortex-M3 Generic User Guide"/>
            <description>
Geehy Semiconductor' APM32F1 series of mainstream MCUs are 32-bit microprocessors based on ARM Cortex'-M3 core, with a maximum operating frequency of 96MHz. Built-in AHB high-performance bus, combined with high-speed memory and DMA, can achieve rapid data processing and storage. Built-in APB advanced peripheral bus extends the rich peripherals and enhanced I/O, guarantees the rapidity of connection and flexibility of control. The chip is equipped with powerful FPU floating-point processing unit, which supports single-precision data processing instructions and data types.
            </description>

            <sequences>

        <!-- Override for Pre-Defined DebugCoreStart Sequence -->
        <sequence name="DebugCoreStart">
          <block>
            // Replication of Standard Functionality
            Write32(0xE000EDF0, 0xA05F0001);                                        // Enable Core Debug via DHCSR

            // Device Specific Debug Setup
            Write32(0xE0042004, DbgMCU_CFG);                                         // DBGMCU_CFG: Configure MCU Debug
          </block>
        </sequence>

        <!-- Override for Pre-Defined TraceStart Sequence -->
        <sequence name="TraceStart">
          <block>
            __var traceSWO    = (__traceout &amp; 0x1) != 0;                        // SWO Trace Selected?
            __var traceTPIU   = (__traceout &amp; 0x2) != 0;                        // TPIU Trace Selected?
          </block>

          <control if="traceSWO">
            <block>
              Sequence("EnableTraceSWO");                                           // Call SWO Trace Setup
            </block>
          </control>

          <control if="traceTPIU">
            <block>
              Sequence("EnableTraceTPIU");                                          // Call TPIU Trace Setup
            </block>
          </control>

        </sequence>

        <!-- User-Defined EnableTraceSWO Sequence -->
        <sequence name="EnableTraceSWO">
          <block>
            __var dbgmcu_val    = 0;                                                // DBGMCU_CFG Value

            dbgmcu_val  = Read32(0xE0042004) &amp; (~0xE0);                         // Read DBGMCU_CFG and clear trace setup
            dbgmcu_val |= (1 &lt;&lt; 5);                                           // Trace I/O Enable + Trace Mode Asynchronous

            Write32(0xE0042004, dbgmcu_val);                                        // Write DBGMCU_CFG: Trace Settings
          </block>
        </sequence>

        <!-- User-Defined EnableTraceTPIU Sequence -->
        <sequence name="EnableTraceTPIU">
          <block>
            __var width         = (__traceout &amp; 0x003F0000) &gt;&gt; 16;        // TPIU Port Width
            __var dbgmcu_val    = 0;                                                // DBGMCU_CFG Value

            dbgmcu_val  = Read32(0xE0042004) &amp; (~0xE0);                         // Read DBGMCU_CFG and clear trace setup
            dbgmcu_val |= (1 &lt;&lt; 5);                                           // Trace I/O Enable

          </block>

          <control if="width == 1">
            <block>
              // 1-Bit TPIU Trace Setup
              dbgmcu_val    |= (1 &lt;&lt; 6);                                      // Trace Mode (1-Bit)
            </block>
          </control>

          <control if="width == 2">
            <block>
              // 2-Bit TPIU Trace Setup
              dbgmcu_val    |= (2 &lt;&lt; 6);                                      // Trace Mode (2-Bit)
            </block>
          </control>

          <control if="width == 4">
            <block>
              // 4-Bit TPIU Trace Setup
              dbgmcu_val    |= (3 &lt;&lt; 6);                                      // Trace Mode (4-Bit)
            </block>
          </control>

          <block>
            // Write Trace Configuration to Target
            Write32(0xE0042004, dbgmcu_val);                                        // Write DBGMCU_CFG: Trace Settings
          </block>

        </sequence>
      </sequences>
            <!-- ************************  Subfamily 'APM32F103'  **************************** -->
            <subFamily DsubFamily="APM32F103">
                <debugvars configfile="Debug/APM32F101_102_103_105_107.dbgconf" version="1.0.0">
                    __var DbgMCU_CFG      = 0x00000007;   // DbgMCU_CFG:  DBG_SLEEP, DBG_STOP, DBG_STANDBY
                </debugvars>

                <feature type="WDT" n="2"/>
                <feature type="RTC" n="32768"/>
                <feature type="VCC" n="2.00" m="3.60"/>
                <feature type="Temp" n="-40" m="85"/>
                <feature type="Temp" n="-40" m="105"/>
                <feature type="USBD" n="1"/>
                <feature type="CAN" n="1"/>
                <!-- *************************  Device 'APM32F103RC'  ***************************** -->
                <device Dname="APM32F103RC">
                    <processor Dfpu="0" Dmpu="0" Dendian="Little-endian" Dclock="96000000"/>
                    <compile header="Device/Device/Geehy/APM32F10x/Include/apm32f10x.h" define="APM32F10X_HD"/>
                    <debug svd="SVD/APM32F103xx.svd"/>
                    <memory id="IROM1" start="0x08000000" size="0x00040000" startup="1" default="1"/>
                    <memory id="IRAM1" start="0x20000000" size="0x00010000" init="0" default="1"/>
                    <algorithm name="Flash/APM32F10x_512.FLM" start="0x08000000" size="0x00080000" default="1"/>
                    <book name="Documents/DATASHEET.pdf" title="APM32F103 Data Sheet"/>
                    <feature type="Timer" n="8" m="16"/>
                    <feature type="ADC" n="16" m="12"/>
                    <feature type="IOs" n="51"/>
                    <feature type="DAC" n="2" m="12"/>
                    <feature type="SPI" n="3" m="18000000"/>
                    <feature type="I2S" n="2"/>
                    <feature type="I2C" n="2"/>
                    <feature type="USART" n="3" m="4500000"/>
                    <feature type="UART" n="2" m="4500000"/>
                    <feature type="SDIO" n="1"/>
                    <feature type="QFP" n="64"/>
                    <feature type="CSP" n="64"/>
                </device>
                <!-- *************************  Device 'APM32F103RD'  ***************************** -->
                <device Dname="APM32F103RD">
                    <processor Dfpu="0" Dmpu="0" Dendian="Little-endian" Dclock="96000000"/>
                    <compile header="Device/Device/Geehy/APM32F10x/Include/apm32f10x.h" define="APM32F10X_HD"/>
                    <debug svd="SVD/APM32F103xx.svd"/>
                    <memory id="IROM1" start="0x08000000" size="0x00060000" startup="1" default="1"/>
                    <memory id="IRAM1" start="0x20000000" size="0x00010000" init="0" default="1"/>
                    <algorithm name="Flash/APM32F10x_512.FLM" start="0x08000000" size="0x00080000" default="1"/>
                    <book name="Documents/DATASHEET.pdf" title="APM32F103 Data Sheet"/>
                    <feature type="Timer" n="8" m="16"/>
                    <feature type="ADC" n="16" m="12"/>
                    <feature type="IOs" n="51"/>
                    <feature type="DAC" n="2" m="12"/>
                    <feature type="SPI" n="3" m="18000000"/>
                    <feature type="I2S" n="2"/>
                    <feature type="I2C" n="2"/>
                    <feature type="USART" n="3" m="4500000"/>
                    <feature type="UART" n="2" m="4500000"/>
                    <feature type="SDIO" n="1"/>
                    <feature type="QFP" n="64"/>
                    <feature type="CSP" n="64"/>
                </device>
                <!-- *************************  Device 'APM32F103RE'  ***************************** -->
                <device Dname="APM32F103RE">
                    <processor Dfpu="0" Dmpu="0" Dendian="Little-endian" Dclock="96000000"/>
                    <compile header="Device/Device/Geehy/APM32F10x/Include/apm32f10x.h" define="APM32F10X_HD"/>
                    <debug svd="SVD/APM32F103xx.svd"/>
                    <memory id="IROM1" start="0x08000000" size="0x00080000" startup="1" default="1"/>
                    <memory id="IRAM1" start="0x20000000" size="0x00020000" init="0" default="1"/>
                    <algorithm name="Flash/APM32F10x_512.FLM" start="0x08000000" size="0x00080000" default="1"/>
                    <book name="Documents/DATASHEET.pdf" title="APM32F103 Data Sheet"/>
                    <feature type="Timer" n="8" m="16"/>
                    <feature type="ADC" n="16" m="16"/>
                    <feature type="IOs" n="51"/>
                    <feature type="DAC" n="2" m="12"/>
                    <feature type="SPI" n="3" m="18000000"/>
                    <feature type="I2S" n="2"/>
                    <feature type="I2C" n="2"/>
                    <feature type="USART" n="3" m="4500000"/>
                    <feature type="UART" n="2" m="4500000"/>
                    <feature type="SDIO" n="1"/>
                    <feature type="QFP" n="64"/>
                    <feature type="CSP" n="64"/>
                </device>
                <!-- *************************  Device 'APM32F103VC'  ***************************** -->
                <device Dname="APM32F103VC">
                    <processor Dfpu="0" Dmpu="0" Dendian="Little-endian" Dclock="96000000"/>
                    <compile header="Device/Device/Geehy/APM32F10x/Include/apm32f10x.h" define="APM32F10X_HD"/>
                    <debug svd="SVD/APM32F103xx.svd"/>
                    <memory id="IROM1" start="0x08000000" size="0x00040000" startup="1" default="1"/>
                    <memory id="IRAM1" start="0x20000000" size="0x00010000" init="0" default="1"/>
                    <algorithm name="Flash/APM32F10x_512.FLM" start="0x08000000" size="0x00080000" default="1"/>
                    <book name="Documents/DATASHEET.pdf" title="APM32F103 Data Sheet"/>
                    <feature type="Timer" n="8" m="16"/>
                    <feature type="ADC" n="16" m="12"/>
                    <feature type="IOs" n="80"/>
                    <feature type="DAC" n="2" m="12"/>
                    <feature type="SPI" n="3" m="18000000"/>
                    <feature type="I2S" n="2"/>
                    <feature type="I2C" n="2"/>
                    <feature type="USART" n="3" m="4500000"/>
                    <feature type="UART" n="2" m="4500000"/>
                    <feature type="SDIO" n="1"/>
                    <feature type="QFP" n="100"/>
                    <feature type="BGA" n="100"/>
                </device>
                <!-- *************************  Device 'APM32F103VD'  ***************************** -->
                <device Dname="APM32F103VD">
                    <processor Dfpu="0" Dmpu="0" Dendian="Little-endian" Dclock="96000000"/>
                    <compile header="Device/Device/Geehy/APM32F10x/Include/apm32f10x.h" define="APM32F10X_HD"/>
                    <debug svd="SVD/APM32F103xx.svd"/>
                    <memory id="IROM1" start="0x08000000" size="0x00060000" startup="1" default="1"/>
                    <memory id="IRAM1" start="0x20000000" size="0x00010000" init="0" default="1"/>
                    <algorithm name="Flash/APM32F10x_512.FLM" start="0x08000000" size="0x00080000" default="1"/>
                    <book name="Documents/DATASHEET.pdf" title="APM32F103 Data Sheet"/>
                    <feature type="Timer" n="8" m="16"/>
                    <feature type="ADC" n="16" m="12"/>
                    <feature type="IOs" n="80"/>
                    <feature type="DAC" n="2" m="12"/>
                    <feature type="SPI" n="3" m="18000000"/>
                    <feature type="I2S" n="2"/>
                    <feature type="I2C" n="2"/>
                    <feature type="USART" n="3" m="4500000"/>
                    <feature type="UART" n="2" m="4500000"/>
                    <feature type="SDIO" n="1"/>
                    <feature type="QFP" n="100"/>
                    <feature type="BGA" n="100"/>
                </device>
                <!-- *************************  Device 'APM32F103VE'  ***************************** -->
                <device Dname="APM32F103VE">
                    <processor Dfpu="0" Dmpu="0" Dendian="Little-endian" Dclock="96000000"/>
                    <compile header="Device/Device/Geehy/APM32F10x/Include/apm32f10x.h" define="APM32F10X_HD"/>
                    <debug svd="SVD/APM32F103xx.svd"/>
                    <memory id="IROM1" start="0x08000000" size="0x00080000" startup="1" default="1"/>
                    <memory id="IRAM1" start="0x20000000" size="0x00020000" init="0" default="1"/>
                    <algorithm name="Flash/APM32F10x_512.FLM" start="0x08000000" size="0x00080000" default="1"/>
                    <book name="Documents/DATASHEET.pdf" title="APM32F103 Data Sheet"/>
                    <feature type="Timer" n="8" m="16"/>
                    <feature type="ADC" n="16" m="12"/>
                    <feature type="IOs" n="80"/>
                    <feature type="DAC" n="2" m="12"/>
                    <feature type="SPI" n="3" m="18000000"/>
                    <feature type="I2S" n="2"/>
                    <feature type="I2C" n="2"/>
                    <feature type="USART" n="3" m="4500000"/>
                    <feature type="UART" n="2" m="4500000"/>
                    <feature type="SDIO" n="1"/>
                    <feature type="QFP" n="100"/>
                    <feature type="BGA" n="100"/>
                </device>
