jhlee741/ece342lab0/blinky-2/blinky/Drivers/CMSIS/.Web/Geehy.APM32F1xx_DFP.pdsc
                <!-- *************************  Device 'APM32F103ZC'  ***************************** -->
                <device Dname="APM32F103ZC">
                    <processor Dfpu="0" Dmpu="0" Dendian="Little-endian" Dclock="96000000"/>
                    <compile header="Device/Device/Geehy/APM32F10x/Include/apm32f10x.h" define="APM32F10X_HD"/>
                    <debug svd="SVD/APM32F103xx.svd"/>
                    <memory id="IROM1" start="0x08000000" size="0x00040000" startup="1" default="1"/>
                    <memory id="IRAM1" start="0x20000000" size="0x00010000" init="0" default="1"/>
                    <algorithm name="Flash/APM32F10x_512.FLM" start="0x08000000" size="0x00080000" default="1"/>
                    <book name="Documents/DATASHEET.pdf" title="APM32F103 Data Sheet"/>
                    <feature type="Timer" n="8" m="16"/>
                    <feature type="ADC" n="21" m="12"/>
                    <feature type="IOs" n="112"/>
                    <feature type="DAC" n="2" m="12"/>
                    <feature type="SPI" n="3" m="18000000"/>
                    <feature type="I2S" n="2"/>
                    <feature type="I2C" n="2"/>
                    <feature type="USART" n="3" m="4500000"/>
                    <feature type="UART" n="2" m="4500000"/>
                    <feature type="SDIO" n="1"/>
                    <feature type="QFP" n="144"/>
                    <feature type="BGA" n="144"/>
                </device>
                <!-- *************************  Device 'APM32F103ZD'  ***************************** -->
                <device Dname="APM32F103ZD">
                    <processor Dfpu="0" Dmpu="0" Dendian="Little-endian" Dclock="96000000"/>
                    <compile header="Device/Device/Geehy/APM32F10x/Include/apm32f10x.h" define="APM32F10X_HD"/>
                    <debug svd="SVD/APM32F103xx.svd"/>
                    <memory id="IROM1" start="0x08000000" size="0x00060000" startup="1" default="1"/>
                    <memory id="IRAM1" start="0x20000000" size="0x00010000" init="0" default="1"/>
                    <algorithm name="Flash/APM32F10x_512.FLM" start="0x08000000" size="0x00080000" default="1"/>
                    <book name="Documents/DATASHEET.pdf" title="APM32F103 Data Sheet"/>
                    <feature type="Timer" n="8" m="16"/>
                    <feature type="ADC" n="21" m="12"/>
                    <feature type="IOs" n="112"/>
                    <feature type="DAC" n="2" m="12"/>
                    <feature type="SPI" n="3" m="18000000"/>
                    <feature type="I2S" n="2"/>
                    <feature type="I2C" n="2"/>
                    <feature type="USART" n="3" m="4500000"/>
                    <feature type="UART" n="2" m="4500000"/>
                    <feature type="SDIO" n="1"/>
                    <feature type="QFP" n="144"/>
                    <feature type="BGA" n="144"/>
                </device>
                <!-- *************************  Device 'APM32F103ZE'  ***************************** -->
                <device Dname="APM32F103ZE">
                    <processor Dfpu="0" Dmpu="0" Dendian="Little-endian" Dclock="96000000"/>
                    <compile header="Device/Device/Geehy/APM32F10x/Include/apm32f10x.h" define="APM32F10X_HD"/>
                    <debug svd="SVD/APM32F103xx.svd"/>
                    <memory id="IROM1" start="0x08000000" size="0x00080000" startup="1" default="1"/>
                    <memory id="IRAM1" start="0x20000000" size="0x00020000" init="0" default="1"/>
                    <algorithm name="Flash/APM32F10x_512.FLM" start="0x08000000" size="0x00080000" default="1"/>
                    <book name="Documents/DATASHEET.pdf" title="APM32F103 Data Sheet"/>
                    <feature type="Timer" n="8" m="16"/>
                    <feature type="ADC" n="21" m="12"/>
                    <feature type="IOs" n="112"/>
                    <feature type="DAC" n="2" m="12"/>
                    <feature type="SPI" n="3" m="18000000"/>
                    <feature type="I2S" n="2"/>
                    <feature type="I2C" n="2"/>
                    <feature type="USART" n="3" m="4500000"/>
                    <feature type="UART" n="2" m="4500000"/>
                    <feature type="SDIO" n="1"/>
                    <feature type="QFP" n="144"/>
                    <feature type="BGA" n="144"/>
                </device>
                <!-- *************************  Device 'APM32F103VB'  ***************************** -->
                <device Dname="APM32F103VB">
                    <processor Dfpu="0" Dmpu="0" Dendian="Little-endian" Dclock="96000000"/>
                    <compile header="Device/Device/Geehy/APM32F10x/Include/apm32f10x.h" define="APM32F10X_MD"/>
                    <debug svd="SVD/APM32F103xx.svd"/>
                    <memory id="IROM1" start="0x08000000" size="0x20000" startup="1" default="1"/><memory id="IRAM1" start="0x20000000" size="0x5000" init="0" default="1"/>
                    <algorithm name="Flash/APM32F10x_128.FLM" start="0x08000000" size="0x20000" default="1"/>
                    <book name="Documents/DATASHEET.pdf" title="APM32F103 Data Sheet"/>
                    <feature type="Timer" n="4" m="16"/>
                    <feature type="ADC" n="16" m="12"/>
                    <feature type="IOs" n="80"/>
                    <feature type="SPI" n="2" m="18000000"/>
                    <feature type="I2C" n="2"/>
                    <feature type="USART" n="3" m="4500000"/>
                    <feature type="QFP" n="100"/>
                    <feature type="BGA" n="100"/>
                </device>
                <!-- *************************  Device 'APM32F103V8'  ***************************** -->
                <device Dname="APM32F103V8">
                    <processor Dfpu="0" Dmpu="0" Dendian="Little-endian" Dclock="96000000"/>
                    <compile header="Device/Device/Geehy/APM32F10x/Include/apm32f10x.h" define="APM32F10X_MD"/>
                    <debug svd="SVD/APM32F103xx.svd"/>
                    <memory id="IROM1" start="0x08000000" size="0x10000" startup="1" default="1"/><memory id="IRAM1" start="0x20000000" size="0x5000" init="0" default="1"/>
                    <algorithm name="Flash/APM32F10x_64.FLM" start="0x08000000" size="0x20000" default="1"/>
                    <book name="Documents/DATASHEET.pdf" title="APM32F103 Data Sheet"/>
                    <feature type="Timer" n="4" m="16"/>
                    <feature type="ADC" n="16" m="12"/>
                    <feature type="IOs" n="80"/>
                    <feature type="SPI" n="2" m="18000000"/>
                    <feature type="I2C" n="2"/>
                    <feature type="USART" n="3" m="4500000"/>
                    <feature type="QFP" n="100"/>
                    <feature type="BGA" n="100"/>
                </device><!-- *************************  Device 'APM32F103RB'  ***************************** --><device Dname="APM32F103RB">
                    <processor Dfpu="0" Dmpu="0" Dendian="Little-endian" Dclock="96000000"/>
                    <compile header="Device/Device/Geehy/APM32F10x/Include/apm32f10x.h" define="APM32F10X_MD"/>
                    <debug svd="SVD/APM32F103xx.svd"/>
                    <memory id="IROM1" start="0x08000000" size="0x20000" startup="1" default="1"/><memory id="IRAM1" start="0x20000000" size="0x5000" init="0" default="1"/>
                    <algorithm name="Flash/APM32F10x_128.FLM" start="0x08000000" size="0x20000" default="1"/>
                    <book name="Documents/DATASHEET.pdf" title="APM32F103 Data Sheet"/>
                    <feature type="Timer" n="4" m="16"/>
                    <feature type="ADC" n="16" m="12"/>
                    <feature type="IOs" n="80"/>
                    <feature type="SPI" n="2" m="18000000"/>
                    <feature type="I2C" n="2"/>
                    <feature type="USART" n="3" m="4500000"/>
                    <feature type="QFP" n="64"/>
                    <feature type="BGA" n="64"/>
                </device><!-- *************************  Device 'APM32F103R8'  ***************************** --><device Dname="APM32F103R8">
                    <processor Dfpu="0" Dmpu="0" Dendian="Little-endian" Dclock="96000000"/>
                    <compile header="Device/Device/Geehy/APM32F10x/Include/apm32f10x.h" define="APM32F10X_MD"/>
                    <debug svd="SVD/APM32F103xx.svd"/>
                    <memory id="IROM1" start="0x08000000" size="0x10000" startup="1" default="1"/><memory id="IRAM1" start="0x20000000" size="0x5000" init="0" default="1"/>
                    <algorithm name="Flash/APM32F10x_64.FLM" start="0x08000000" size="0x20000" default="1"/>
                    <book name="Documents/DATASHEET.pdf" title="APM32F103 Data Sheet"/>
                    <feature type="Timer" n="4" m="16"/>
                    <feature type="ADC" n="16" m="12"/>
                    <feature type="IOs" n="80"/>
                    <feature type="SPI" n="2" m="18000000"/>
                    <feature type="I2C" n="2"/>
                    <feature type="USART" n="3" m="4500000"/>
                    <feature type="QFP" n="64"/>
                    <feature type="BGA" n="64"/>
                </device><!-- *************************  Device 'APM32F103R6'  ***************************** --><device Dname="APM32F103R6">
                    <processor Dfpu="0" Dmpu="0" Dendian="Little-endian" Dclock="96000000"/>
                    <compile header="Device/Device/Geehy/APM32F10x/Include/apm32f10x.h" define="APM32F10X_LD"/>
                    <debug svd="SVD/APM32F103xx.svd"/>
                    <memory id="IROM1" start="0x08000000" size="0x8000" startup="1" default="1"/><memory id="IRAM1" start="0x20000000" size="0x2800" init="0" default="1"/>
                    <algorithm name="Flash/APM32F10x_32.FLM" start="0x08000000" size="0x20000" default="1"/>
                    <book name="Documents/DATASHEET.pdf" title="APM32F103 Data Sheet"/>
                    <feature type="Timer" n="4" m="16"/>
                    <feature type="ADC" n="16" m="12"/>
                    <feature type="IOs" n="80"/>
                    <feature type="SPI" n="2" m="18000000"/>
                    <feature type="I2C" n="2"/>
                    <feature type="USART" n="3" m="4500000"/>
                    <feature type="QFP" n="64"/>
                    <feature type="BGA" n="64"/>
                </device><!-- *************************  Device 'APM32F103R4'  ***************************** --><device Dname="APM32F103R4">
                    <processor Dfpu="0" Dmpu="0" Dendian="Little-endian" Dclock="96000000"/>
                    <compile header="Device/Device/Geehy/APM32F10x/Include/apm32f10x.h" define="APM32F10X_LD"/>
                    <debug svd="SVD/APM32F103xx.svd"/>
                    <memory id="IROM1" start="0x08000000" size="0x4000" startup="1" default="1"/><memory id="IRAM1" start="0x20000000" size="0x1800" init="0" default="1"/>
                    <algorithm name="Flash/APM32F10x_16.FLM" start="0x08000000" size="0x40000" default="1"/>
                    <book name="Documents/DATASHEET.pdf" title="APM32F103 Data Sheet"/>
                    <feature type="Timer" n="4" m="16"/>
                    <feature type="ADC" n="16" m="12"/>
                    <feature type="IOs" n="80"/>
                    <feature type="SPI" n="2" m="18000000"/>
                    <feature type="I2C" n="2"/>
                    <feature type="USART" n="3" m="4500000"/>
                    <feature type="QFP" n="64"/>
                    <feature type="BGA" n="64"/>
                </device><!-- *************************  Device 'APM32F103CB'  ***************************** --><device Dname="APM32F103CB">
                    <processor Dfpu="0" Dmpu="0" Dendian="Little-endian" Dclock="96000000"/>
                    <compile header="Device/Device/Geehy/APM32F10x/Include/apm32f10x.h" define="APM32F10X_MD"/>
                    <debug svd="SVD/APM32F103xx.svd"/>
                    <memory id="IROM1" start="0x08000000" size="0x20000" startup="1" default="1"/>
                    <memory id="IRAM1" start="0x20000000" size="0x5000" init="0" default="1"/>
                    <algorithm name="Flash/APM32F10x_128.FLM" start="0x08000000" size="0x20000" default="1"/>
                    <book name="Documents/DATASHEET.pdf" title="APM32F103 Data Sheet"/>
                    <feature type="Timer" n="4" m="16"/>
                    <feature type="ADC" n="16" m="12"/>
                    <feature type="IOs" n="80"/>
                    <feature type="SPI" n="2" m="18000000"/>
                    <feature type="I2C" n="2"/>
                    <feature type="USART" n="3" m="4500000"/>
                    <feature type="QFP" n="48"/>
                    <feature type="BGA" n="48"/>
                </device><!-- *************************  Device 'APM32F103C8'  ***************************** --><device Dname="APM32F103C8">
                    <processor Dfpu="0" Dmpu="0" Dendian="Little-endian" Dclock="96000000"/>
                    <compile header="Device/Device/Geehy/APM32F10x/Include/apm32f10x.h" define="APM32F10X_MD"/>
                    <debug svd="SVD/APM32F103xx.svd"/>
                    <memory id="IROM1" start="0x08000000" size="0x10000" startup="1" default="1"/><memory id="IRAM1" start="0x20000000" size="0x5000" init="0" default="1"/>
                    <algorithm name="Flash/APM32F10x_64.FLM" start="0x08000000" size="0x10000" default="1"/>
                    <book name="Documents/DATASHEET.pdf" title="APM32F103 Data Sheet"/>
                    <feature type="Timer" n="4" m="16"/>
                    <feature type="ADC" n="16" m="12"/>
                    <feature type="IOs" n="80"/>
                    <feature type="SPI" n="2" m="18000000"/>
                    <feature type="I2C" n="2"/>
                    <feature type="USART" n="3" m="4500000"/>
                    <feature type="QFP" n="48"/>
                    <feature type="BGA" n="48"/>
                </device><!-- *************************  Device 'APM32F103C6'  ***************************** --><device Dname="APM32F103C6">
                    <processor Dfpu="0" Dmpu="0" Dendian="Little-endian" Dclock="96000000"/>
                    <compile header="Device/Device/Geehy/APM32F10x/Include/apm32f10x.h" define="APM32F10X_LD"/>
                    <debug svd="SVD/APM32F103xx.svd"/>
                    <memory id="IROM1" start="0x08000000" size="0x8000" startup="1" default="1"/><memory id="IRAM1" start="0x20000000" size="0x2800" init="0" default="1"/>
                    <algorithm name="Flash/APM32F10x_32.FLM" start="0x08000000" size="0x8000" default="1"/>
                    <book name="Documents/DATASHEET.pdf" title="APM32F103 Data Sheet"/>
                    <feature type="Timer" n="4" m="16"/>
                    <feature type="ADC" n="16" m="12"/>
                    <feature type="IOs" n="80"/>
                    <feature type="SPI" n="2" m="18000000"/>
                    <feature type="I2C" n="2"/>
                    <feature type="USART" n="3" m="4500000"/>
                    <feature type="QFP" n="48"/>
                    <feature type="BGA" n="48"/>
                </device><!-- *************************  Device 'APM32F103C4'  ***************************** --><device Dname="APM32F103C4">
                    <processor Dfpu="0" Dmpu="0" Dendian="Little-endian" Dclock="96000000"/>
                    <compile header="Device/Device/Geehy/APM32F10x/Include/apm32f10x.h" define="APM32F10X_LD"/>
                    <debug svd="SVD/APM32F103xx.svd"/>
                    <memory id="IROM1" start="0x08000000" size="0x4000" startup="1" default="1"/><memory id="IRAM1" start="0x20000000" size="0x1800" init="0" default="1"/>
                    <algorithm name="Flash/APM32F10x_16.FLM" start="0x08000000" size="0x4000" default="1"/>
                    <book name="Documents/DATASHEET.pdf" title="APM32F103 Data Sheet"/>
                    <feature type="Timer" n="4" m="16"/>
                    <feature type="ADC" n="16" m="12"/>
                    <feature type="IOs" n="80"/>
                    <feature type="SPI" n="2" m="18000000"/>
                    <feature type="I2C" n="2"/>
                    <feature type="USART" n="3" m="4500000"/>
                    <feature type="QFP" n="48"/>
                    <feature type="BGA" n="48"/>
                </device><!-- *************************  Device 'APM32F103TB'  ***************************** --><device Dname="APM32F103TB">
                    <processor Dfpu="0" Dmpu="0" Dendian="Little-endian" Dclock="96000000"/>
                    <compile header="Device/Device/Geehy/APM32F10x/Include/apm32f10x.h" define="APM32F10X_MD"/>
                    <debug svd="SVD/APM32F103xx.svd"/>
                    <memory id="IROM1" start="0x08000000" size="0x20000" startup="1" default="1"/><memory id="IRAM1" start="0x20000000" size="0x5000" init="0" default="1"/>
                    <algorithm name="Flash/APM32F10x_128.FLM" start="0x08000000" size="0x20000" default="1"/>
                    <book name="Documents/DATASHEET.pdf" title="APM32F103 Data Sheet"/>
                    <feature type="Timer" n="4" m="16"/>
                    <feature type="ADC" n="16" m="12"/>
                    <feature type="IOs" n="80"/>
                    <feature type="SPI" n="2" m="18000000"/>
                    <feature type="I2C" n="2"/>
                    <feature type="USART" n="3" m="4500000"/>
                    <feature type="QFP" n="32"/>
                    <feature type="BGA" n="32"/>
                </device><!-- *************************  Device 'APM32F103T8'  ***************************** --><device Dname="APM32F103T8">
                    <processor Dfpu="0" Dmpu="0" Dendian="Little-endian" Dclock="96000000"/>
                    <compile header="Device/Device/Geehy/APM32F10x/Include/apm32f10x.h" define="APM32F10X_MD"/>
                    <debug svd="SVD/APM32F103xx.svd"/>
                    <memory id="IROM1" start="0x08000000" size="0x10000" startup="1" default="1"/><memory id="IRAM1" start="0x20000000" size="0x5000" init="0" default="1"/>
                    <algorithm name="Flash/APM32F10x_64.FLM" start="0x08000000" size="0x10000" default="1"/>
                    <book name="Documents/DATASHEET.pdf" title="APM32F103 Data Sheet"/>
                    <feature type="Timer" n="4" m="16"/>
                    <feature type="ADC" n="16" m="12"/>
                    <feature type="IOs" n="80"/>
                    <feature type="SPI" n="2" m="18000000"/>
                    <feature type="I2C" n="2"/>
                    <feature type="USART" n="3" m="4500000"/>
                    <feature type="QFP" n="32"/>
                    <feature type="BGA" n="32"/>
                </device><!-- *************************  Device 'APM32F103T6'  ***************************** --><device Dname="APM32F103T6">
                    <processor Dfpu="0" Dmpu="0" Dendian="Little-endian" Dclock="96000000"/>
                    <compile header="Device/Device/Geehy/APM32F10x/Include/apm32f10x.h" define="APM32F10X_LD"/>
                    <debug svd="SVD/APM32F103xx.svd"/>
                    <memory id="IROM1" start="0x08000000" size="0x8000" startup="1" default="1"/><memory id="IRAM1" start="0x20000000" size="0x2800" init="0" default="1"/>
                    <algorithm name="Flash/APM32F10x_32.FLM" start="0x08000000" size="0x8000" default="1"/>
                    <book name="Documents/DATASHEET.pdf" title="APM32F103 Data Sheet"/>
                    <feature type="Timer" n="4" m="16"/>
                    <feature type="ADC" n="16" m="12"/>
                    <feature type="IOs" n="80"/>
                    <feature type="SPI" n="2" m="18000000"/>
                    <feature type="I2C" n="2"/>
                    <feature type="USART" n="3" m="4500000"/>
                    <feature type="QFP" n="32"/>
                    <feature type="BGA" n="32"/>
                </device>
                <!-- *************************  Device 'APM32F103T4'  ***************************** -->
                <device Dname="APM32F103T4">
                    <processor Dfpu="0" Dmpu="0" Dendian="Little-endian" Dclock="96000000"/>
                    <compile header="Device/Device/Geehy/APM32F10x/Include/apm32f10x.h" define="APM32F10X_LD"/>
                    <debug svd="SVD/APM32F103xx.svd"/>
                    <memory id="IROM1" start="0x08000000" size="0x4000" startup="1" default="1"/>
                    <memory id="IRAM1" start="0x20000000" size="0x1800" init="0" default="1"/>
                    <algorithm name="Flash/APM32F10x_16.FLM" start="0x08000000" size="0x4000" default="1"/>
                    <book name="Documents/DATASHEET.pdf" title="APM32F103 Data Sheet"/>
                    <feature type="Timer" n="4" m="16"/>
                    <feature type="ADC" n="16" m="12"/>
                    <feature type="IOs" n="80"/>
                    <feature type="SPI" n="2" m="18000000"/>
                    <feature type="I2C" n="2"/>
                    <feature type="USART" n="3" m="4500000"/>
                    <feature type="QFP" n="32"/>
                    <feature type="BGA" n="32"/>
                </device><!-- *************************  Device 'APM32F103CC'  ***************************** --><device Dname="APM32F103CC">
                    <processor Dfpu="0" Dmpu="0" Dendian="Little-endian" Dclock="96000000"/>
                    <compile header="Device/Device/Geehy/APM32F10x/Include/apm32f10x.h" define="APM32F10X_HD"/>
                    <debug svd="SVD/APM32F103xx.svd"/>
                    <memory id="IROM1" start="0x08000000" size="0x00040000" startup="1" default="1"/>
                    <memory id="IRAM1" start="0x20000000" size="0x00010000" init="0" default="1"/>
                    <algorithm name="Flash/APM32F10x_512.FLM" start="0x08000000" size="0x00080000" default="1"/>
                    <book name="Documents/DATASHEET.pdf" title="APM32F103 Data Sheet"/>
                    <feature type="Timer" n="7" m="16"/>
                    <feature type="ADC" n="10" m="12"/>
                    <feature type="IOs" n="37"/>
                    <feature type="DAC" n="2" m="12"/>
                    <feature type="SPI" n="3" m="18000000"/>
                    <feature type="I2S" n="2"/>
                    <feature type="I2C" n="2"/>
                    <feature type="USART" n="3" m="4500000"/>
                    <feature type="QFP" n="48"/>
                </device>
            </subFamily>
