jhlee741/ece342lab0/blinky-2/blinky/Drivers/CMSIS/.Web/Geehy.APM32F1xx_DFP.pdsc
            <!-- ************************  Subfamily 'APM32F105'  **************************** -->
            <subFamily DsubFamily="APM32F105">
                <debugvars configfile="Debug/APM32F101_102_103_105_107.dbgconf" version="1.0.0">
                    __var DbgMCU_CFG      = 0x00000007;   // DbgMCU_CFG:  DBG_SLEEP, DBG_STOP, DBG_STANDBY
                </debugvars>

                <feature type="WDT" n="2"/>
                <feature type="RTC" n="32768"/>
                <feature type="VCC" n="2.00" m="3.60"/>
                <feature type="Temp" n="-40" m="85"/>
                <feature type="Temp" n="-40" m="105"/>
                <feature type="CAN" n="2"/>
                <feature type="Timer" n="7" m="16"/>
                <feature type="ADC" n="16" m="12"/>
                <feature type="DAC" n="2" m="12"/>
                <feature type="SPI" n="3" m="18000000"/>
                <feature type="I2S" n="2"/>
                <feature type="I2C" n="2"/>
                <feature type="USART" n="3" m="4500000"/>
                <feature type="UART" n="2" m="4500000"/>
                <!-- *************************  Device 'APM32F105RC'  ***************************** -->
                <device Dname="APM32F105RC">
                    <processor Dfpu="0" Dmpu="0" Dendian="Little-endian" Dclock="96000000"/>
                    <compile header="Device/Device/Geehy/APM32F10x/Include/apm32f10x.h" define="APM32F10X_CL"/>
                    <debug svd="SVD/APM32F105xx.svd"/>
                    <memory id="IROM1" start="0x08000000" size="0x00040000" startup="1" default="1"/>
                    <memory id="IRAM1" start="0x20000000" size="0x00010000" init="0" default="1"/>
                    <algorithm name="Flash/APM32F10x_CL.FLM" start="0x08000000" size="0x00040000" default="1"/>
                    <book name="Documents/DATASHEET.pdf" title="APM32F105 Data Sheet"/>
                    <feature type="IOs" n="51"/>
                </device>
                <!--*************************  Device 'APM32F105VC'  ***************************** -->
                <device Dname="APM32F105VC">
                    <processor Dfpu="0" Dmpu="0" Dendian="Little-endian" Dclock="96000000"/>
                    <compile header="Device/Device/Geehy/APM32F10x/Include/apm32f10x.h" define="APM32F10X_CL"/>
                    <debug svd="SVD/APM32F105xx.svd"/>
                    <memory id="IROM1" start="0x08000000" size="0x00040000" startup="1" default="1"/>
                    <memory id="IRAM1" start="0x20000000" size="0x00010000" init="0" default="1"/>
                    <algorithm name="Flash/APM32F10x_CL.FLM" start="0x08000000" size="0x00040000" default="1"/>
                    <book name="Documents/DATASHEET.pdf" title="APM32F105 Data Sheet"/>
                    <feature type="IOs" n="80"/>
                </device>
                <!-- *************************  Device 'APM32F105VB'  ***************************** -->
                <device Dname="APM32F105VB">
                    <processor Dfpu="0" Dmpu="0" Dendian="Little-endian" Dclock="96000000"/>
                    <compile header="Device/Device/Geehy/APM32F10x/Include/apm32f10x.h" define="APM32F10X_CL"/>
                    <debug svd="SVD/APM32F105xx.svd"/>
                    <memory id="IROM1" start="0x08000000" size="0x20000" startup="1" default="1"/><memory id="IRAM1" start="0x20000000" size="0x00010000" init="0" default="1"/>
                    <algorithm name="Flash/APM32F10x_CL.FLM" start="0x08000000" size="0x20000" default="1"/>
                    <book name="Documents/DATASHEET.pdf" title="APM32F105 Data Sheet"/>
                    <feature type="IOs" n="80"/>
                </device>
                <!-- *************************  Device 'APM32F105V8'  ***************************** -->
                <device Dname="APM32F105V8">
                    <processor Dfpu="0" Dmpu="0" Dendian="Little-endian" Dclock="96000000"/>
                    <compile header="Device/Device/Geehy/APM32F10x/Include/apm32f10x.h" define="APM32F10X_CL"/>
                    <debug svd="SVD/APM32F105xx.svd"/>
                    <memory id="IROM1" start="0x08000000" size="0x10000" startup="1" default="1"/><memory id="IRAM1" start="0x20000000" size="0x00010000" init="0" default="1"/>
                    <algorithm name="Flash/APM32F10x_CL.FLM" start="0x08000000" size="0x10000" default="1"/>
                    <book name="Documents/DATASHEET.pdf" title="APM32F105 Data Sheet"/>
                    <feature type="IOs" n="80"/>
                </device><!-- *************************  Device 'APM32F105RB'  ***************************** --><device Dname="APM32F105RB">
                    <processor Dfpu="0" Dmpu="0" Dendian="Little-endian" Dclock="96000000"/>
                    <compile header="Device/Device/Geehy/APM32F10x/Include/apm32f10x.h" define="APM32F10X_CL"/>
                    <debug svd="SVD/APM32F105xx.svd"/>
                    <memory id="IROM1" start="0x08000000" size="0x20000" startup="1" default="1"/><memory id="IRAM1" start="0x20000000" size="0x00010000" init="0" default="1"/>
                    <algorithm name="Flash/APM32F10x_CL.FLM" start="0x08000000" size="0x20000" default="1"/>
                    <book name="Documents/DATASHEET.pdf" title="APM32F105 Data Sheet"/>
                    <feature type="IOs" n="51"/>
                </device><!-- *************************  Device 'APM32F105R8'  ***************************** --><device Dname="APM32F105R8">
                    <processor Dfpu="0" Dmpu="0" Dendian="Little-endian" Dclock="96000000"/>
                    <compile header="Device/Device/Geehy/APM32F10x/Include/apm32f10x.h" define="APM32F10X_CL"/>
                    <debug svd="SVD/APM32F105xx.svd"/>
                    <memory id="IROM1" start="0x08000000" size="0x10000" startup="1" default="1"/><memory id="IRAM1" start="0x20000000" size="0x00010000" init="0" default="1"/>
                    <algorithm name="Flash/APM32F10x_CL.FLM" start="0x08000000" size="0x10000" default="1"/>
                    <book name="Documents/DATASHEET.pdf" title="APM32F105 Data Sheet"/>
                    <feature type="IOs" n="51"/>
                </device>
            </subFamily>
            <!-- ************************  Subfamily 'APM32F107'  **************************** -->
            <subFamily DsubFamily="APM32F107">
                <debugvars configfile="Debug/APM32F101_102_103_105_107.dbgconf" version="1.0.0">
                    __var DbgMCU_CFG      = 0x00000007;   // DbgMCU_CFG:  DBG_SLEEP, DBG_STOP, DBG_STANDBY
                </debugvars>
                <feature type="WDT" n="2"/>
                <feature type="RTC" n="32768"/>
                <feature type="VCC" n="2.00" m="3.60"/>
                <feature type="Temp" n="-40" m="85"/>
                <feature type="Temp" n="-40" m="105"/>
                <feature type="CAN" n="2"/>
                <feature type="ETH" n="1"/>
                <feature type="Timer" n="7" m="16"/>
                <feature type="ADC" n="16" m="12"/>
                <feature type="DAC" n="2" m="12"/>
                <feature type="SPI" n="3" m="18000000"/>
                <feature type="I2S" n="2"/>
                <feature type="I2C" n="1"/>
                <feature type="USART" n="3" m="4500000"/>
                <feature type="UART" n="2" m="4500000"/>
                <!-- *************************  Device 'APM32F107RC'  ***************************** -->
                <device Dname="APM32F107RC">
                    <processor Dfpu="0" Dmpu="0" Dendian="Little-endian" Dclock="96000000"/>
                    <compile header="Device/Device/Geehy/APM32F10x/Include/apm32f10x.h" define="APM32F10X_CL"/>
                    <debug svd="SVD/APM32F107xx.svd"/>
                    <memory id="IROM1" start="0x08000000" size="0x00040000" startup="1" default="1"/>
                    <memory id="IRAM1" start="0x20000000" size="0x00010000" init="0" default="1"/>
                    <algorithm name="Flash/APM32F10x_CL.FLM" start="0x08000000" size="0x00040000" default="1"/>
                    <book name="Documents/DATASHEET.pdf" title="APM32F107 Data Sheet"/>
                    <feature type="IOs" n="51"/>
                </device>
                <!--*************************  Device 'APM32F107VC'  ***************************** -->
                <device Dname="APM32F107VC">
                    <processor Dfpu="0" Dmpu="0" Dendian="Little-endian" Dclock="96000000"/>
                    <compile header="Device/Device/Geehy/APM32F10x/Include/apm32f10x.h" define="APM32F10X_CL"/>
                    <debug svd="SVD/APM32F107xx.svd"/>
                    <memory id="IROM1" start="0x08000000" size="0x00040000" startup="1" default="1"/>
                    <memory id="IRAM1" start="0x20000000" size="0x00010000" init="0" default="1"/>
                    <algorithm name="Flash/APM32F10x_CL.FLM" start="0x08000000" size="0x00040000" default="1"/>
                    <book name="Documents/DATASHEET.pdf" title="APM32F107 Data Sheet"/>
                    <feature type="IOs" n="80"/>
                </device>
                <!-- *************************  Device 'APM32F107VB'  ***************************** -->
                <device Dname="APM32F107VB">
                    <processor Dfpu="0" Dmpu="0" Dendian="Little-endian" Dclock="96000000"/>
                    <compile header="Device/Device/Geehy/APM32F10x/Include/apm32f10x.h" define="APM32F10X_CL"/>
                    <debug svd="SVD/APM32F107xx.svd"/>
                    <memory id="IROM1" start="0x08000000" size="0x20000" startup="1" default="1"/><memory id="IRAM1" start="0x20000000" size="0x00010000" init="0" default="1"/>
                    <algorithm name="Flash/APM32F10x_CL.FLM" start="0x08000000" size="0x20000" default="1"/>
                    <book name="Documents/DATASHEET.pdf" title="APM32F107 Data Sheet"/>
                    <feature type="IOs" n="80"/>
                </device>
                <!-- *************************  Device 'APM32F107RB'  ***************************** --><device Dname="APM32F107RB">
                    <processor Dfpu="0" Dmpu="0" Dendian="Little-endian" Dclock="96000000"/>
                    <compile header="Device/Device/Geehy/APM32F10x/Include/apm32f10x.h" define="APM32F10X_CL"/>
                    <debug svd="SVD/APM32F107xx.svd"/>
                    <memory id="IROM1" start="0x08000000" size="0x20000" startup="1" default="1"/><memory id="IRAM1" start="0x20000000" size="0x00010000" init="0" default="1"/>
                    <algorithm name="Flash/APM32F10x_CL.FLM" start="0x08000000" size="0x20000" default="1"/>
                    <book name="Documents/DATASHEET.pdf" title="APM32F107 Data Sheet"/>
                    <feature type="IOs" n="51"/>
                </device>
            </subFamily>
        </family>
    </devices>
    <conditions>
        <!-- conditions selecting Compiler -->
        <condition id="Compiler ARMCC">
            <require Tcompiler="ARMCC"/>
        </condition>
