jhlee741/ece342lab0/blinky-2/blinky/Drivers/CMSIS/.Web/Geehy.APM32F1xx_DFP.pdsc
        <condition id="APM32F1xx">
            <description>Geehy Semiconductor APM32F1xx Device</description>
            <require Dvendor="Geehy:163" Dname="APM32F1*"/>
        </condition>
        <condition id="APM32F1xx LD">
            <description>Geehy Semiconductor APM32F1xx Low Density Device</description>
            <require Dvendor="Geehy:163" Dname="APM32F10[123]?[46]"/>
        </condition>
        <condition id="APM32F1xx MD">
            <description>Geehy Semiconductor APM32F1xx Mid Density Device</description>
            <require Dvendor="Geehy:163" Dname="APM32F10[123]?[8B]"/>
        </condition><condition id="APM32F1xx HD">
            <description>Geehy Semiconductor APM32F1xx High Density Device</description>
            <require Dvendor="Geehy:163" Dname="APM32F10[123]?[CDE]"/>
        </condition>
        <condition id="APM32F1xx CL">
            <description>Geehy Semiconductor APM32F1xx Connectivity Line Device</description>
            <require Dvendor="Geehy:163" Dname="APM32F10[57]?[8BC]"/>
        </condition><condition id="APM32F1xx LD ARMCC">
            <description>filter for APM32F1xx Low Density Device and the ARM compiler</description>
            <require condition="APM32F1xx LD"/>
            <require Tcompiler="ARMCC"/>
        </condition>
        <condition id="APM32F1xx MD ARMCC">
            <description>filter for APM32F1xx Mid Density Device and the ARM compiler</description>
            <require condition="APM32F1xx MD"/>
            <require Tcompiler="ARMCC"/>
        </condition>
        <condition id="APM32F1xx HD ARMCC">
            <description>filter for APM32F1xx High Density Device and the ARM compiler</description>
            <require condition="APM32F1xx HD"/>
            <require Tcompiler="ARMCC"/>
        </condition><condition id="APM32F1xx CL ARMCC">
            <description>filter for APM32F1xx Connectivity Line Device and the ARM compiler</description>
            <require condition="APM32F1xx CL"/>
            <require Tcompiler="ARMCC"/>
        </condition><condition id="APM32F1xx CMSIS">
            <description>Geehy Semiconductor APM32F1xx Device with CMSIS</description>
            <require condition="APM32F1xx"/>
            <require Cclass="CMSIS" Cgroup="CORE"/>
        </condition>
        <condition id="APM32F1xx STDPERIPH">
            <description>Geehy Semiconductor APM32F1xx with Standard Peripherals Drivers Framework</description>
            <require condition="APM32F1xx CMSIS"/>
            <require Cclass="Device" Cgroup="StdPeriph Drivers" Csub="Framework"/>
        </condition>
        <condition id="APM32F1xx STDPERIPH RCM">
            <description>Geehy Semiconductor APM32F1xx with Standard Peripherals Drivers Framework and RCM</description>
            <require condition="APM32F1xx CMSIS"/>
            <require Cclass="Device" Cgroup="StdPeriph Drivers" Csub="Framework"/>
            <require Cclass="Device" Cgroup="StdPeriph Drivers" Csub="RCM"/>
        </condition>
    </conditions>
    <components>
        <component Cclass="Device" Cgroup="Startup" Cversion="1.0.3" condition="APM32F1xx CMSIS">
            <description>System Startup for Geehy Semiconductor APM32F1xx device series</description>
            <files>
                <!--  include folder -->
                <file category="include" name="Device/Device/Geehy/APM32F10x/Include/"/>
                <!-- startup files -->
                <file category="source" name="Device/Device/Geehy/APM32F10x/Source/arm/startup_apm32f10x_md.s" attr="config" version="1.0.3" condition="APM32F1xx MD ARMCC"/><file category="source" name="Device/Device/Geehy/APM32F10x/Source/arm/startup_apm32f10x_hd.s" attr="config" version="1.0.3" condition="APM32F1xx HD ARMCC"/><file category="source" name="Device/Device/Geehy/APM32F10x/Source/arm/startup_apm32f10x_cl.s" attr="config" version="1.0.0" condition="APM32F1xx CL ARMCC"/>
                <!-- system file -->
                <file category="source" name="Device/Device/Geehy/APM32F10x/Source/system_apm32f10x.c" attr="config" version="1.0.4"/>
                <!-- device configuration required by drivers at the moment -->
            </files>
        </component>
        <!-- START: Geehy Semiconductor Standard Peripherals Drivers -->
        <component Cclass="Device" Cgroup="StdPeriph Drivers" Csub="Framework" Cversion="1.0.4" condition="APM32F1xx STDPERIPH">
            <description>Standard Peripherals Drivers Framework</description>
            <RTE_Components_h>#define RTE_DEVICE_STDPERIPH_FRAMEWORK</RTE_Components_h>
            <files>
                <file category="include" name="Device/StdPeriphDriver/inc/"/>
                <file category="header" name="Device/StdPeriphDriver/inc/apm32f10x_misc.h"/>
                <file category="source" name="Device/StdPeriphDriver/src/apm32f10x_misc.c"/>

                <file category="header" name="Device/Templates/apm32f10x_int.h" attr="template" select="Interrupt Service Routines"/>
                <file category="source" name="Device/Templates/apm32f10x_int.c" attr="template" select="Interrupt Service Routines"/>
            </files>
        </component>
        <component Cclass="Device" Cgroup="StdPeriph Drivers" Csub="ADC" Cversion="1.0.4" condition="APM32F1xx STDPERIPH RCM">
            <description>Analog-to-digital converter (ADC) driver for APM32F10x</description>
            <RTE_Components_h>#define RTE_DEVICE_STDPERIPH_ADC </RTE_Components_h>
            <files>
                <file category="header" name="Device/StdPeriphDriver/inc/apm32f10x_adc.h"/>
                <file category="source" name="Device/StdPeriphDriver/src/apm32f10x_adc.c"/>
            </files>
        </component>
        <component Cclass="Device" Cgroup="StdPeriph Drivers" Csub="BAKPR" Cversion="1.0.4" condition="APM32F1xx STDPERIPH">
            <description>Backup registers (BAKPR) driver for APM32F10x</description>
            <RTE_Components_h>#define RTE_DEVICE_STDPERIPH_BAKR      </RTE_Components_h>
            <files>
                <file category="header" name="Device/StdPeriphDriver/inc/apm32f10x_bakpr.h"/>
                <file category="source" name="Device/StdPeriphDriver/src/apm32f10x_bakpr.c"/>
            </files>
        </component>
