jhlee741/ece342lab0/blinky-2/blinky/Drivers/CMSIS/.Web/Geehy.APM32F1xx_DFP.pdsc
        <component Cclass="Device" Cgroup="StdPeriph Drivers" Csub="CAN" Cversion="1.0.4" condition="APM32F1xx STDPERIPH RCM">
            <description>Controller area network (CAN) driver for APM32F1xx</description>
            <RTE_Components_h>#define RTE_DEVICE_STDPERIPH_CAN      </RTE_Components_h>
            <files>
                <file category="header" name="Device/StdPeriphDriver/inc/apm32f10x_can.h"/>
                <file category="source" name="Device/StdPeriphDriver/src/apm32f10x_can.c"/>
            </files>
        </component>
        <component Cclass="Device" Cgroup="StdPeriph Drivers" Csub="CRC" Cversion="1.0.4" condition="APM32F1xx STDPERIPH">
            <description>CRC calculation unit (CRC) driver for APM32F1xx</description>
            <RTE_Components_h>#define RTE_DEVICE_STDPERIPH_CRC      </RTE_Components_h>
            <files>
                <file category="header" name="Device/StdPeriphDriver/inc/apm32f10x_crc.h"/>
                <file category="source" name="Device/StdPeriphDriver/src/apm32f10x_crc.c"/>
            </files>
        </component>
        <component Cclass="Device" Cgroup="StdPeriph Drivers" Csub="DMA" Cversion="1.0.4" condition="APM32F1xx STDPERIPH RCM">
            <description>DMA controller (DMA) driver for APM32F1xx</description>
            <RTE_Components_h>#define RTE_DEVICE_STDPERIPH_DMA      </RTE_Components_h>
            <files>
                <file category="header" name="Device/StdPeriphDriver/inc/apm32f10x_dma.h"/>
                <file category="source" name="Device/StdPeriphDriver/src/apm32f10x_dma.c"/>
            </files>
        </component>
        <component Cclass="Device" Cgroup="StdPeriph Drivers" Csub="EINT" Cversion="1.0.4" condition="APM32F1xx STDPERIPH">
            <description>External interrupt/event controller (EINT) driver for APM32F1xx</description>
            <RTE_Components_h>#define RTE_DEVICE_STDPERIPH_EINT </RTE_Components_h>
            <files>
                <file category="header" name="Device/StdPeriphDriver/inc/apm32f10x_eint.h"/>
                <file category="source" name="Device/StdPeriphDriver/src/apm32f10x_eint.c"/>
            </files>
        </component>
        <component Cclass="Device" Cgroup="StdPeriph Drivers" Csub="FMC" Cversion="1.0.4" condition="APM32F1xx STDPERIPH">
            <description>Flash memory controller driver for APM32F1xx</description>
            <RTE_Components_h>#define RTE_DEVICE_STDPERIPH_FMC     </RTE_Components_h>
            <files>
                <file category="header" name="Device/StdPeriphDriver/inc/apm32f10x_fmc.h"/>
                <file category="source" name="Device/StdPeriphDriver/src/apm32f10x_fmc.c"/>
            </files>
        </component>
        <component Cclass="Device" Cgroup="StdPeriph Drivers" Csub="GPIO" Cversion="1.0.4" condition="APM32F1xx STDPERIPH RCM">
            <description>General-purpose I/O (GPIO) driver for APM32F1xx</description>
            <RTE_Components_h>#define RTE_DEVICE_STDPERIPH_GPIO      </RTE_Components_h>
            <files>
                <file category="header" name="Device/StdPeriphDriver/inc/apm32f10x_gpio.h"/>
                <file category="source" name="Device/StdPeriphDriver/src/apm32f10x_gpio.c"/>
            </files>
        </component>
        <component Cclass="Device" Cgroup="StdPeriph Drivers" Csub="I2C" Cversion="1.0.4" condition="APM32F1xx STDPERIPH RCM">
            <description>Inter-integrated circuit (I2C) interface driver for APM32F1xx</description>
            <RTE_Components_h>#define RTE_DEVICE_STDPERIPH_I2C      </RTE_Components_h>
            <files>
                <file category="header" name="Device/StdPeriphDriver/inc/apm32f10x_i2c.h"/>
                <file category="source" name="Device/StdPeriphDriver/src/apm32f10x_i2c.c"/>
            </files>
        </component>
        <component Cclass="Device" Cgroup="StdPeriph Drivers" Csub="SCI2C" Cversion="1.0.4" condition="APM32F1xx STDPERIPH RCM">
            <description>SC Inter-integrated circuit (SCI2C) interface driver for APM32F1xx</description>
            <RTE_Components_h>#define RTE_DEVICE_STDPERIPH_SCI2C      </RTE_Components_h>
            <files>
                <file category="header" name="Device/StdPeriphDriver/inc/apm32f10x_sci2c.h"/>
                <file category="source" name="Device/StdPeriphDriver/src/apm32f10x_sci2c.c"/>
            </files>
        </component><component Cclass="Device" Cgroup="StdPeriph Drivers" Csub="IWDT" Cversion="1.0.4" condition="APM32F1xx STDPERIPH">
            <description>Independent watchdog (IWDT) driver for APM32F1xx</description>
            <RTE_Components_h>#define RTE_DEVICE_STDPERIPH_IWDT</RTE_Components_h>
            <files>
                <file category="header" name="Device/StdPeriphDriver/inc/apm32f10x_iwdt.h"/>
                <file category="source" name="Device/StdPeriphDriver/src/apm32f10x_iwdt.c"/>
            </files>
        </component>
        <component Cclass="Device" Cgroup="StdPeriph Drivers" Csub="PMU" Cversion="1.0.4" condition="APM32F1xx STDPERIPH RCM">
            <description>Power controller (PMU) driver for APM32F1xx</description>
            <RTE_Components_h>#define RTE_DEVICE_STDPERIPH_PMU</RTE_Components_h>
            <files>
                <file category="header" name="Device/StdPeriphDriver/inc/apm32f10x_pmu.h"/>
                <file category="source" name="Device/StdPeriphDriver/src/apm32f10x_pmu.c"/>
            </files>
        </component>
        <component Cclass="Device" Cgroup="StdPeriph Drivers" Csub="RCM" Cversion="1.0.4" condition="APM32F1xx STDPERIPH">
            <description>Reset and clock management unit (RCM) driver for APM32F1xx</description>
            <RTE_Components_h>#define RTE_DEVICE_STDPERIPH_RCM</RTE_Components_h>
            <files>
                <file category="header" name="Device/StdPeriphDriver/inc/apm32f10x_rcm.h"/>
                <file category="source" name="Device/StdPeriphDriver/src/apm32f10x_rcm.c"/>
            </files>
        </component>
        <component Cclass="Device" Cgroup="StdPeriph Drivers" Csub="SPI" Cversion="1.0.4" condition="APM32F1xx STDPERIPH RCM">
            <description>Serial peripheral interface (SPI) driver for APM32F1xx</description>
            <RTE_Components_h>#define RTE_DEVICE_STDPERIPH_SPI      </RTE_Components_h>
            <files>
                <file category="header" name="Device/StdPeriphDriver/inc/apm32f10x_spi.h"/>
                <file category="source" name="Device/StdPeriphDriver/src/apm32f10x_spi.c"/>
            </files>
        </component>
        <component Cclass="Device" Cgroup="StdPeriph Drivers" Csub="QSPI" Cversion="1.0.4" condition="APM32F1xx STDPERIPH RCM">
            <description>Queued Serial peripheral interface (QSPI) driver for APM32F1xx</description>
            <RTE_Components_h>#define RTE_DEVICE_STDPERIPH_QSPI      </RTE_Components_h>
            <files>
                <file category="header" name="Device/StdPeriphDriver/inc/apm32f10x_qspi.h"/>
                <file category="source" name="Device/StdPeriphDriver/src/apm32f10x_qspi.c"/>
            </files>
        </component><component Cclass="Device" Cgroup="StdPeriph Drivers" Csub="TMR" Cversion="1.0.4" condition="APM32F1xx STDPERIPH RCM">
            <description>Timers (TMR) driver for APM32F1xx</description>
            <RTE_Components_h>#define RTE_DEVICE_STDPERIPH_TMR</RTE_Components_h>
            <files>
                <file category="header" name="Device/StdPeriphDriver/inc/apm32f10x_tmr.h"/>
                <file category="source" name="Device/StdPeriphDriver/src/apm32f10x_tmr.c"/>
            </files>
        </component>
