jhlee741/ece342lab0/blinky-2/blinky/Drivers/CMSIS/.Web/Geehy.APM32F1xx_DFP.pdsc
        <component Cclass="Device" Cgroup="StdPeriph Drivers" Csub="USART" Cversion="1.0.4" condition="APM32F1xx STDPERIPH RCM">
            <description>Universal synchronous asynchronous receiver transmitter (USART) driver for APM32F1xx</description>
            <RTE_Components_h>#define RTE_DEVICE_STDPERIPH_USART</RTE_Components_h>
            <files>
                <file category="header" name="Device/StdPeriphDriver/inc/apm32f10x_usart.h"/>
                <file category="source" name="Device/StdPeriphDriver/src/apm32f10x_usart.c"/>
            </files>
        </component>
        <component Cclass="Device" Cgroup="StdPeriph Drivers" Csub="WWDT" Cversion="1.0.4" condition="APM32F1xx STDPERIPH RCM">
            <description>Window watchdog (WWDT) driver for APM32F1xx</description>
            <RTE_Components_h>#define RTE_DEVICE_STDPERIPH_WWDT</RTE_Components_h>
            <files>
                <file category="header" name="Device/StdPeriphDriver/inc/apm32f10x_wwdt.h"/>
                <file category="source" name="Device/StdPeriphDriver/src/apm32f10x_wwdt.c"/>
            </files>
        </component>
        <component Cclass="Device" Cgroup="StdPeriph Drivers" Csub="SMC" Cversion="1.0.4" condition="APM32F1xx STDPERIPH RCM">
            <description>SMC driver for APM32F1xx</description>
            <RTE_Components_h>#define RTE_DEVICE_STDPERIPH_SMC</RTE_Components_h>
            <files>
                <file category="header" name="Device/StdPeriphDriver/inc/apm32f10x_smc.h"/>
                <file category="source" name="Device/StdPeriphDriver/src/apm32f10x_smc.c"/>
            </files>
        </component>
        <component Cclass="Device" Cgroup="StdPeriph Drivers" Csub="DMC" Cversion="1.0.4" condition="APM32F1xx STDPERIPH">
            <description>SDRC driver for APM32F1xx</description>
            <RTE_Components_h>#define RTE_DEVICE_STDPERIPH_SDRC</RTE_Components_h>
            <files>
                <file category="header" name="Device/StdPeriphDriver/inc/apm32f10x_dmc.h"/>
                <file category="source" name="Device/StdPeriphDriver/src/apm32f10x_dmc.c"/>
            </files>
        </component><component Cclass="Device" Cgroup="StdPeriph Drivers" Csub="DAC" Cversion="1.0.4" condition="APM32F1xx STDPERIPH RCM">
            <description>Digital-to-analog converter (DAC) driver for APM32F1xx</description>
            <RTE_Components_h>#define RTE_DEVICE_STDPERIPH_DAC</RTE_Components_h>
            <files>
                <file category="header" name="Device/StdPeriphDriver/inc/apm32f10x_dac.h"/>
                <file category="source" name="Device/StdPeriphDriver/src/apm32f10x_dac.c"/>
            </files>
        </component><component Cclass="Device" Cgroup="StdPeriph Drivers" Csub="DBGMCU" Cversion="1.0.4" condition="APM32F1xx STDPERIPH">
            <description>MCU debug component (DBGMCU) driver for APM32F1xx</description>
            <RTE_Components_h>#define RTE_DEVICE_STDPERIPH_DBGMCU</RTE_Components_h>
            <files>
                <file category="header" name="Device/StdPeriphDriver/inc/apm32f10x_dbgmcu.h"/>
                <file category="source" name="Device/StdPeriphDriver/src/apm32f10x_dbgmcu.c"/>
            </files>
        </component><component Cclass="Device" Cgroup="StdPeriph Drivers" Csub="SDIO" Cversion="1.0.4" condition="APM32F1xx STDPERIPH RCM">
            <description>Secure digital (SDIO) interface driver for APM32F1xx</description>
            <RTE_Components_h>#define RTE_DEVICE_STDPERIPH_SDIO</RTE_Components_h>
            <files>
                <file category="header" name="Device/StdPeriphDriver/inc/apm32f10x_sdio.h"/>
                <file category="source" name="Device/StdPeriphDriver/src/apm32f10x_sdio.c"/>
            </files>
        </component><component Cclass="Device" Cgroup="StdPeriph Drivers" Csub="RTC" Cversion="1.0.4" condition="APM32F1xx STDPERIPH">
            <description>Real-time clock (RTC) driver for APM32F1xx</description>
            <RTE_Components_h>#define RTE_DEVICE_STDPERIPH_RTC</RTE_Components_h>
            <files>
                <file category="header" name="Device/StdPeriphDriver/inc/apm32f10x_rtc.h"/>
                <file category="source" name="Device/StdPeriphDriver/src/apm32f10x_rtc.c"/>
            </files>
        </component>
        <!-- END: Geehy Semiconductor Standard Peripherals Drivers -->
    </components>
    <boards>
        <board vendor="Geehy" name="APM32F103MINI" revision="Ver 1.0">
            <description>Geehy APM32F103 Development Board</description>
            <image large="Boards/Geehy/APM32F103MINI/Documentation/APM32F103ZE_MINI.JPG"/>
            <mountedDevice deviceIndex="0" Dvendor="Geehy:163" Dname="APM32F103"/>
            <compatibleDevice deviceIndex="0" Dvendor="Geehy:163" DsubFamily="APM32F103"/>
            <feature type="XTAL" n="8000000"/>
            <feature type="PWR" n="5" name="USB Powered"/>
            <feature type="USB" n="1" name="USB 2.0 Full Speed Device"/>
            <feature type="RS232" n="1"/>
            <feature type="Button" n="3" name="Reset, KEY1 and KEY2"/>
            <feature type="LED" n="2" name="LEDs directly connected to port pins"/>
            <debugInterface adapter="JTAG/SW" connector="20 pin JTAG (0.1 inch connector)"/>
        </board><board vendor="Geehy" name="APM32F107MINI" revision="Ver 1.0">
            <description>Geehy APM32F107 Development Board</description>
            <image large="Boards/Geehy/APM32F107MINI/Documentation/APM32F107VC_MINI.JPG"/>
            <mountedDevice deviceIndex="0" Dvendor="Geehy:163" Dname="APM32F107"/>
            <compatibleDevice deviceIndex="0" Dvendor="Geehy:163" DsubFamily="APM32F107"/>
            <feature type="XTAL" n="8000000"/>
            <feature type="PWR" n="5" name="USB Powered"/>
            <feature type="USB" n="1" name="USB 2.0 Full Speed Device"/>
            <feature type="RS232" n="1"/>
            <feature type="Button" n="3" name="Reset, KEY1 and KEY2"/>
            <feature type="LED" n="2" name="LEDs directly connected to port pins"/>
            <debugInterface adapter="JTAG/SW" connector="20 pin JTAG (0.1 inch connector)"/>
        </board>
    </boards>
    <examples>
        <example name="APM32F103MINI-Blinky" doc="readme.txt" folder="Boards/Geehy/APM32F103MINI/Blinky">
            <description>APM32F103_MINI  Blinky example</description>
            <board name="APM32F103MINI" vendor="Geehy"/>
            <project>
                <environment name="uv" load="APM32F103MINI-Blinky.uvprojx"/>
            </project>
            <attributes>
                <component Cclass="CMSIS" Cgroup="CORE"/>
                <component Cclass="Device" Cgroup="Startup"/>
                <component Cclass="CMSIS" Cgroup="RTOS"/>
                <category>Getting Started</category>
                <category>CMSIS-RTX</category>
                <keyword>LED</keyword>
                <keyword>APM32F103</keyword>

            </attributes>
        </example><example name="APM32F107MINI-Blinky" doc="readme.txt" folder="Boards/Geehy/APM32F107MINI/Blinky">
            <description>APM32F107_MINI  Blinky example</description>
            <board name="APM32F107MINI" vendor="Geehy"/>
            <project>
                <environment name="uv" load="APM32F107MINI-Blinky.uvprojx"/>
            </project>
            <attributes>
                <component Cclass="CMSIS" Cgroup="CORE"/>
                <component Cclass="Device" Cgroup="Startup"/>
                <component Cclass="CMSIS" Cgroup="RTOS"/>
                <category>Getting Started</category>
                <category>CMSIS-RTX</category>
                <keyword>LED</keyword>
                <keyword>APM32F107</keyword>

            </attributes>
        </example>
    </examples>
</package>